"use client";
import BannerNews from "@/components/common/BannerNews";
import Link from "next/link";

export default function BreakingNews({ data }) {
  // const data = [
  //   {
  //     heading:
  //       "যুক্তরাষ্ট্র ও ইউক্রেন খনিজ সম্পদ চুক্তিতে সম্মত হয়েছে, কর্মকর্তারা বলেন",
  //     description:
  //       "গাজার ওপর ব্যাপক বিমান হামলা চালিয়েছে ইসরায়েল। হামলায় অন্তত ২২০ ফিলিস্তিনির মৃত্যুর খবর পাওয়া গেছে। মৃতের মধ্যে অনেক নারী ও শিশু রয়েছে। ইসরায়েল ডিফেন্স ফোর্স (আইডিএফ) জানিয়েছে",
  //     author: "এলেন জোশের প্রতিবেদন",
  //     image: "https://images.unsplash.com/photo-1550533105-d412cbf5bfcc?q=80",
  //     date: "৯ই জুন, ২০২৫",
  //   },
  //   {
  //     heading:
  //       "যুক্তরাষ্ট্র ও ইউক্রেন খনিজ সম্পদ চুক্তিতে সম্মত হয়েছে, কর্মকর্তারা বলেন",
  //     description:
  //       "গাজার ওপর ব্যাপক বিমান হামলা চালিয়েছে ইসরায়েল। হামলায় অন্তত ২২০ ফিলিস্তিনির মৃত্যুর খবর পাওয়া গেছে। মৃতের মধ্যে অনেক নারী ও শিশু রয়েছে। ইসরায়েল ডিফেন্স ফোর্স (আইডিএফ) জানিয়েছে",
  //     author: "এলেন জোশের প্রতিবেদন",
  //     image: "https://images.unsplash.com/photo-1550533105-d412cbf5bfcc?q=80",
  //     date: "৯ই জুন, ২০২৫",
  //   },
  //   {
  //     heading:
  //       "যুক্তরাষ্ট্র ও ইউক্রেন খনিজ সম্পদ চুক্তিতে সম্মত হয়েছে, কর্মকর্তারা বলেন",
  //     description:
  //       "গাজার ওপর ব্যাপক বিমান হামলা চালিয়েছে ইসরায়েল। হামলায় অন্তত ২২০ ফিলিস্তিনির মৃত্যুর খবর পাওয়া গেছে। মৃতের মধ্যে অনেক নারী ও শিশু রয়েছে। ইসরায়েল ডিফেন্স ফোর্স (আইডিএফ) জানিয়েছে",
  //     author: "এলেন জোশের প্রতিবেদন",
  //     image: "https://images.unsplash.com/photo-1550533105-d412cbf5bfcc?q=80",
  //     date: "৯ই জুন, ২০২৫",
  //   },
  //   {
  //     heading:
  //       "যুক্তরাষ্ট্র ও ইউক্রেন খনিজ সম্পদ চুক্তিতে সম্মত হয়েছে, কর্মকর্তারা বলেন",
  //     description:
  //       "গাজার ওপর ব্যাপক বিমান হামলা চালিয়েছে ইসরায়েল। হামলায় অন্তত ২২০ ফিলিস্তিনির মৃত্যুর খবর পাওয়া গেছে। মৃতের মধ্যে অনেক নারী ও শিশু রয়েছে। ইসরায়েল ডিফেন্স ফোর্স (আইডিএফ) জানিয়েছে",
  //     author: "এলেন জোশের প্রতিবেদন",
  //     image: "https://images.unsplash.com/photo-1550533105-d412cbf5bfcc?q=80",
  //     date: "৯ই জুন, ২০২৫",
  //   },
  // ];
  return (
    <div className="flex flex-col w-full gap-6">
      {data?.map((item, index) => (
        <Link href={`/article/${item.id}`} key={index} className="w-full">
          <BannerNews key={index} item={item} />
        </Link>
      ))}
    </div>
  );
}
